export const ThreeColumnsBlockData = [
  {
    img: '/img/mainPage/razryadi/624a058fadac0d6ba512a126c6bcab3b.jpeg',
    header: 'Мужской разряд',
    tags: ['Русская парная', 'Бассейн', 'Хамам'],
    schedule: [
      ['Понедельник', '11:00 — 23:00'],
      ['Вторник', '13:00 — 23:00'],
      ['Среда', '11:00 — 23:00'],
      ['Четверг', '11:00 — 23:00'],
      ['Пятница', '11:00 — 23:00'],
      ['Суббота', '09:00 — 23:00'],
      ['Воскресенье', '09:00 — 23:00']
    ],
    price: ['1950', '2 часа']
  },
  {
    img: '/img/mainPage/razryadi/a4e7f235808aafac4df84c7ed14fb90a.jpeg',
    header: 'Высший мужской разряд',
    tags: ['Русская парная', 'Бассейн', 'Купель'],
    schedule: [
      ['Среда', '11:00 — 23:00'],
      ['Четверг', '11:00 — 23:00'],
      ['Пятница', '11:00 — 23:00'],
      ['Суббота', '09:00 — 23:00'],
      ['Воскресенье', '09:00 — 23:00']
    ],
    price: ['2500', '2 часа']
  },
  {
    img: '/img/mainPage/razryadi/088edf0157c22276f535233deb19efd5.jpeg',
    header: 'Женский разряд',
    tags: ['Русская парная', 'Бассейн', 'Хамам'],
    schedule: [
      ['Понедельник', '13:00 — 23:00'],
      ['Вторник', '11:00 — 23:00']
    ],
    price: ['1950', '3 часа']
  }
];
